### Case Study 2
### üçï Pizza Runner Part 3

Source : <a href='https://8weeksqlchallenge.com/case-study-2/'>8 Weel SQL Challenge</a>
***

In [1]:
%load_ext sql

In [2]:
%sql sqlite:///datasets/pizza_runner.sqlite

### <font color='green'>Pizza Metrics</font>

#### 1.  How many pizzas were ordered?

Checking data types in **customer_orders**

In [7]:
%%sql
PRAGMA TABLE_INFO(customer_orders)

 * sqlite:///datasets/pizza_runner.sqlite
Done.

[(0, 'order_id', 'INTEGER', 0, None, 0),
 (1, 'customer_id', 'INTEGER', 0, None, 0),
 (2, 'pizza_id', 'INTEGER', 0, None, 0),
 (3, 'exclusions', 'VARCHAR(4)', 0, None, 0),
 (4, 'extras', 'VARCHAR(4)', 0, None, 0),
 (5, 'order_time', 'TIMESTAMP', 0, None, 0)]

In [34]:
%%sql

SELECT COUNT(pizza_id) AS pizza_ordered
FROM customer_orders

 * sqlite:///datasets/pizza_runner.sqlite
Done.

[(14,)]

#### 2. How many unique customer orders were made?

In [24]:
%%sql
SELECT COUNT(DISTINCT order_id) AS unique_order
FROM customer_orders

 * sqlite:///datasets/pizza_runner.sqlite
Done.

[(10,)]

#### 3. How many successful orders were delivered by each runner?

In [29]:
%%sql
SELECT COUNT(DISTINCT order_id) AS unique_orders_delivered_by_runner
FROM runner_orders
WHERE cancellation = ''

 * sqlite:///datasets/pizza_runner.sqlite
Done.

[(8,)]

#### 4.  How many of each type of pizza was delivered?

#### Creating temp table of `customer_orders` with only pizza delivered

In [3]:
%%sql
CREATE TEMP TABLE customer_orders_delivered AS
SELECT *
FROM customer_orders
WHERE order_id IN (
    SELECT DISTINCT order_id
    FROM runner_orders
    WHERE cancellation = ''
)

 * sqlite:///datasets/pizza_runner.sqlite
Done.

[]

In [8]:
%%sql
SELECT
    pizza_name,
    num_ordered
FROM(
    SELECT pizza_id AS pizza_id,
           COUNT(pizza_id) AS num_ordered
    FROM customer_orders_delivered
    GROUP BY pizza_id
) AS t1
JOIN pizza_names t2
ON t1.pizza_id = t2.pizza_id

 * sqlite:///datasets/pizza_runner.sqlite
Done.

[('Meatlovers', 9), ('Vegetarian', 3)]

#### 5.  How many Vegetarian and Meatlovers were ordered by each customer?

In [10]:
%%sql
SELECT *
FROM pizza_names

 * sqlite:///datasets/pizza_runner.sqlite
Done.

[(1, 'Meatlovers'), (2, 'Vegetarian')]

In [12]:
%%sql
SELECT
    customer_id,
    SUM(CASE WHEN pizza_id = 1 THEN 1 ELSE 0 END) AS meatlover_ordered,
    SUM(CASE WHEN pizza_id = 2 THEN 1 ELSE 0 END) AS vegetarian_ordered
FROM customer_orders t1
GROUP BY customer_id

 * sqlite:///datasets/pizza_runner.sqlite
Done.

[(101, 2, 1), (102, 2, 1), (103, 3, 1), (104, 3, 0), (105, 0, 1)]

#### 6.  What was the maximum number of pizzas delivered in a single order?

In [13]:
%%sql
SELECT
    customer_id,
    order_id,
    COUNT(pizza_id)  AS num_pizza  
FROM customer_orders_delivered
GROUP BY customer_id,order_id
ORDER BY num_pizza DESC
LIMIT 1

 * sqlite:///datasets/pizza_runner.sqlite
Done.

[(103, 4, 3)]

#### 7.  For each customer, how many delivered pizzas had at least 1 change and how many had no changes?

In [57]:
%%sql
SELECT customer_id,
       COUNT(CASE WHEN exclusions = '' AND extras ='' THEN 1 END) AS num_pizza_no_change ,
       COUNT(CASE WHEN exclusions <> '' OR extras <> '' THEN 1 END) AS num_pizza_change
FROM customer_orders_delivered
GROUP BY customer_id

 * sqlite:///datasets/pizza_runner.sqlite
Done.

[(101, 2, 0), (102, 3, 0), (103, 0, 3), (104, 1, 2), (105, 0, 1)]

#### 8.  How many pizzas were delivered that had both exclusions and extras?

In [60]:
%%sql
SELECT COUNT(*) AS pizza_with_exclusion_and_extras
FROM customer_orders_delivered
WHERE exclusions <> '' AND extras <> ''

 * sqlite:///datasets/pizza_runner.sqlite
Done.

[(1,)]

#### 9. What was the total volume of pizzas ordered for each hour of the day?

In [65]:
%%sql
SELECT 
    strftime('%H',order_time) AS hr,
    COUNT(pizza_id) AS pizza_ordered
FROM customer_orders
GROUP BY hr
ORDER BY pizza_ordered DESC

 * sqlite:///datasets/pizza_runner.sqlite
Done.

[('23', 3), ('21', 3), ('18', 3), ('13', 3), ('19', 1), ('11', 1)]

#### 10. What was the volume of orders for each day of the week?

In [68]:
%%sql
SELECT 
    CASE CAST(strftime('%w',order_time) AS INTEGER)
    WHEN 0 THEN 'Sunday'
    WHEN 1 THEN 'Monday'
    WHEN 2 THEN 'Tuesday'
    WHEN 3 THEN 'Wenesday'
    WHEN 4 THEN 'Thursday'
    WHEN 5 THEN 'Friday'
    ELSE 'Saturday' END AS weekday,
    COUNT(pizza_id) AS pizza_ordered
FROM customer_orders
GROUP BY weekday
ORDER BY pizza_ordered DESC

 * sqlite:///datasets/pizza_runner.sqlite
Done.

[('Wenesday', 5), ('Saturday', 5), ('Thursday', 3), ('Friday', 1)]

<a id='experience'></a>
### <font color='green'>Runner and Customer Experience </font>

In [46]:
%%sql

PRAGMA TABLE_INFO(runner_orders)

 * sqlite:///datasets/pizza_runner.sqlite
Done.

[(0, 'order_id', 'INTEGER', 0, None, 0),
 (1, 'runner_id', 'INTEGER', 0, None, 0),
 (2, 'pickup_time', 'VARCHAR(19)', 0, None, 0),
 (3, 'distance', 'VARCHAR(7)', 0, None, 0),
 (4, 'duration', 'VARCHAR(10)', 0, None, 0),
 (5, 'cancellation', 'VARCHAR(23)', 0, None, 0)]

In [43]:
%%sql

DROP TABLE IF EXISTS runner_orders_2;
CREATE TEMP TABLE runner_orders_2 AS 
    SELECT 
        order_id,
        runner_id,
        pickup_time,
        CAST(distance AS DECIMAL) AS distance,
        CAST(duration AS INTEGER) AS duration
    FROM runner_orders

 * sqlite:///datasets/pizza_runner.sqlite
Done.
Done.

[]

In [44]:
%%sql
SELECT *
FROM runner_orders_2

 * sqlite:///datasets/pizza_runner.sqlite
Done.

[(1, 1, '2020-01-01 18:15:34', 20, 32),
 (2, 1, '2020-01-01 19:10:54', 20, 27),
 (3, 1, '2020-01-03 00:12:37', 13.4, 20),
 (4, 2, '2020-01-04 13:53:03', 23.4, 40),
 (5, 3, '2020-01-08 21:10:57', 10, 15),
 (6, 3, 'null', 0, 0),
 (7, 2, '2020-01-08 21:30:45', 25, 25),
 (8, 2, '2020-01-10 00:15:02', 23.4, 15),
 (9, 2, 'null', 0, 0),
 (10, 1, '2020-01-11 18:50:20', 10, 10)]

In [45]:
%%sql
PRAGMA TABLE_INFO(runner_orders_2)

 * sqlite:///datasets/pizza_runner.sqlite
Done.

[(0, 'order_id', 'INT', 0, None, 0),
 (1, 'runner_id', 'INT', 0, None, 0),
 (2, 'pickup_time', 'TEXT', 0, None, 0),
 (3, 'distance', 'NUM', 0, None, 0),
 (4, 'duration', 'INT', 0, None, 0)]

#### 1. How many runners signed up for each 1 week period? (i.e. week starts 2021-01-01)

In [65]:
%%sql
SELECT 
    strftime('%W',registration_date)+1 AS week,
    COUNT(DISTINCT runner_id) AS runner_registered
FROM runners
GROUP BY week

 * sqlite:///datasets/pizza_runner.sqlite
Done.

[(1, 2), (2, 1), (3, 1)]

In [66]:
%%sql
SELECT COUNT(DISTINCT runner_id)
FROM runners

 * sqlite:///datasets/pizza_runner.sqlite
Done.

[(4,)]

#### 2. What was the average time in minutes it took for each runner to arrive at the Pizza Runner HQ to pickup the order?

In [16]:
%%sql
DROP TABLE IF EXISTS order_time_table;
CREATE TEMP TABLE order_time_table AS 
SELECT 
    order_id , 
    customer_id,
    MIN(order_time) AS order_time,
    COUNT(pizza_id) AS pizza_count
FROM customer_orders
GROUP BY order_id

 * sqlite:///datasets/pizza_runner.sqlite
Done.
Done.

[]

In [44]:
%%sql
SELECT 
    t1.runner_id,
    ROUND(AVG((julianday(t1.pickup_time) - julianday(t2.order_time))*24*60),2) AS avg_runner_pickup_time
FROM runner_orders t1
JOIN order_time_table t2
ON t1.order_id = t2.order_id
WHERE t1.cancellation = ''
GROUP BY runner_id

 * sqlite:///datasets/pizza_runner.sqlite
Done.

[(1, 14.33), (2, 20.01), (3, 10.47)]

#### 3. Is there any relationship between the number of pizzas and how long the order takes to prepare?

In [121]:
%%sql

SELECT 
    t2.pizza_count,
    ROUND(AVG((julianday(t1.pickup_time)- julianday(t2.order_time))*24*60),2) AS avg_prep_time_mins
FROM runner_orders t1
JOIN order_time_table t2
ON t1.order_id = t2.order_id
WHERE t1.cancellation = ''
GROUP BY t2.pizza_count
ORDER BY avg_prep_time_mins DESC

 * sqlite:///datasets/pizza_runner.sqlite
Done.

[(3, 29.28), (2, 18.37), (1, 12.36)]

#### 4.  What was the average distance travelled for each customer?

In [21]:
%%sql
DROP TABLE IF EXISTS customer_order_table;
CREATE TEMP TABLE customer_order_table AS
SELECT
    t1.*,
    t2.*
FROM runner_orders t1
JOIN order_time_table t2
ON t1.order_id = t2.order_id

 * sqlite:///datasets/pizza_runner.sqlite
Done.
Done.

[]

In [ ]:

ORDER BY avg_distance_km DESC
_km

In [55]:
%%sql
SELECT
    customer_id,
    ROUND(AVG(CAST(distance AS DECIMAL)),2) AS avg_distance_km
FROM customer_order_table
WHERE cancellation = ''
GROUP BY customer_id
ORDER BY customer_id

 * sqlite:///datasets/pizza_runner.sqlite
Done.

[(101, 20.0), (102, 18.4), (103, 23.4), (104, 10.0), (105, 25.0)]

#### 5. What was the difference between the longest and shortest delivery times for all orders?

In [23]:
%%sql
SELECT
    MIN(duration),
    MAX(duration),
    MAX(duration) - MIN(duration) AS diff_mins
FROM customer_order_table
WHERE cancellation = ''

 * sqlite:///datasets/pizza_runner.sqlite
Done.

[('10', '40', 30)]

#### 6. What was the average speed for each runner for each delivery and do you notice any trend for these values?

In [27]:
%%sql

SELECT runner_id,
       distance, 
       ROUND(distance/duration*60,2) AS avg_speed_km_min
FROM customer_order_table
WHERE cancellation = ''
ORDER BY 1

 * sqlite:///datasets/pizza_runner.sqlite
Done.

[(1, '20.0', 37.5),
 (1, '20.0', 44.44),
 (1, '13.4', 40.2),
 (1, '10.0', 60.0),
 (2, '23.4', 35.1),
 (2, '25.0', 60.0),
 (2, '23.4', 93.6),
 (3, '10.0', 40.0)]

#### 7. What is the successful delivery percentage for each runner?

In [60]:
%%sql

SELECT
    runner_id,
    delivered_order,
    total_orders,
    delivered_order*1.0/total_orders*100 AS delivery_sucess_perc
FROM(
    SELECT 
        runner_id,
        COUNT(*) AS delivered_order,
        (
            SELECT COUNT(order_id) 
            FROM runner_orders t1
            WHERE t1.runner_id = t2.runner_id
        ) AS total_orders
    FROM runner_orders t2
    WHERE pickup_time <> 'null'
    GROUP BY runner_id
)

 * sqlite:///datasets/pizza_runner.sqlite
Done.

[(1, 4, 4, 100.0), (2, 3, 4, 75.0), (3, 1, 2, 50.0)]

In [62]:
%%sql
SELECT *
FROM customer_orders

 * sqlite:///datasets/pizza_runner.sqlite
Done.

[(1, 101, 1, '', '', '2020-01-01 18:05:02'),
 (2, 101, 1, '', '', '2020-01-01 19:00:52'),
 (3, 102, 1, '', '', '2020-01-02 23:51:23'),
 (3, 102, 2, '', '', '2020-01-02 23:51:23'),
 (4, 103, 1, '4', '', '2020-01-04 13:23:46'),
 (4, 103, 1, '4', '', '2020-01-04 13:23:46'),
 (4, 103, 2, '4', '', '2020-01-04 13:23:46'),
 (5, 104, 1, '', '1', '2020-01-08 21:00:29'),
 (6, 101, 2, '', '', '2020-01-08 21:03:13'),
 (7, 105, 2, '', '1', '2020-01-08 21:20:29'),
 (8, 102, 1, '', '', '2020-01-09 23:54:33'),
 (9, 103, 1, '4', '1, 5', '2020-01-10 11:22:59'),
 (10, 104, 1, '', '', '2020-01-11 18:34:49'),
 (10, 104, 1, '2, 6', '1, 4', '2020-01-11 18:34:49')]

#### Prev : üçï <a href='case_study_2_pizza_part_2.ipynb'> Pizza Runner PART 2 </a>

#### Next : üçï <a href='case_study_2_pizza_part_4.ipynb'> Pizza Runner PART 4 </a>

#### Back to : <a href='https://github.com/sumedhadewan/8-week-sql-challenge' target='_blank'>Project Table of Content</a>